package Environment;

public class Descriptions {
    public static String help = """
                
                Основные команды:
                Локация - получить описание текущей локации.
                Предметы - получить описание инвентаря текущей локации.
                Взять - добавить предмет из локации к себе в инвентарь.
                Выложить - добавить предмет из своего инвентаря в локацию.
                Инвентарь - показать предметы из твоего инвентаря.
                Использовать - использовать предмет из инвентаря. 
                Вперёд (ё обязательна), назад, влево, вправо - пойти в соответсвующую сторону, если это возможно.
                Выход - закончить игру. (Сохранение пока ещё, к сожалению, не завезли).
                Помощь - прочитать это сообщение ещё раз.
                """;
    public static String pubDescription = """
                
                Ты в таверне, любимом месте практически всех жителей деревни.
                В кабаке проходит вся общественная и культурная жизнь деревни: собрания, обмен новостями, встречи с друзьями,
                попойки, пьяные драки, трезвые драки...
                
                За прилавком стоит твоя возлюбленная - Яна.
                Вдоль стен помещения расставлены лавки и столы. На стенах венки и полки.
                Во дворе несколько столов в тени большого дуба, вокруг таверны посажены цветы.
                Видно, что за внешним видом заведения следят.
                
                Позади тебя находится рынок.
                """;
    public static String kuneshHomeDescription = """
                
                Ты находишься во дворе Кунеша.
                
                Обычная крестьянская изба, практически такая же, как у твоей семьи.
                За ней хлев, птичник, в котором бегают цыплята и колода для колки дров.
                
                Сзади тебя находится рынок.
                """;
    public static String marketDescription = """
                
                Центр деревни Скалица. Он же - рынок. Здесь есть самые разнообразные лавки: бортник, суконщик, мясник,
                цирюльник, углежог, заезжий купец...
                Не счесть всех торговцев. 
                Те, кто богаче, обосновались не просто под навесами, а открыли свои заведения в помещениях, на первых этажах теремов.
                
                В центре находится колодец, чуть в стороне стойла для лошадей и охапка сена.
                
                Слева - двор Кунеша, а справа - кабак.
                Позади тебя - кузница.
                """;
    public static String castleDescription = """
                
                Не такой уж и огромный, но всё же замок. Самая внушительная и красивая постройка в этой местоности - замок пана Радцига.
                Внутрь тебя вряд-ли пустят, поэтому придётся обращаться к охране на входе.
                
                Перед тобой возвышаются ворота замка с двумя стражами по сторонам.
                
                Сзади тебя находится кузница твоего отца.
                """;
    public static String forgeDescription = """
                
                Кузница твоего отца, в которой он проводит подавляющее большинство времени. 
                
                И сейчас он, как обычно, занят работой за наковальней.
                
                Слева от кузницы находится большой замок пана Радцига, властителя этой деревни и прилегающих земель.
                С другой стороны, напротив замка, ворота непосредственно в деревню, а именно на рынок. У ворот стоит скот.
                Рядом крестьянин разгружает телегу с сеном. 
                Сзади находится твой дом.
                """;
    public static String homeDescription = """
                
                Ты находишься в своём доме, состоящем из одной комнаты, которая не выглядит слишком богато, но и бедной её никак нельзя назвать.
                Перед тобой дверь в сени, из которых можно выйти на улицу. В стенах окна, в углу печь. Несколько лавок для сна, стол, полки с самыми разными вещами.
                Обычный крестьянский дом, но такой родной для тебя.
                В углу ты видишь сундук.
                """;
}
